def fast(a,g,N):
    g = bin(g) # σύμφωνα με την ασκηση πρεπεπι να αναπαραστήσουμε τον αλγόριθμο σε δυαδική μορφη (gn..gn-1)
    g = g[2:] # για να μη εμφανιστεί το '0b' στην δυαδιή αναπαράσταση του εκθέτη
    d, x = 1, a
    # επειδή όμως η τοποθέτηση γίνεται ανάποδα δλδ g1g2..gn
    for i in range(len(g)-1,-1,-1):
        if g[i] == '1':
            d = (d * x) % N
        x = (x ** 2) % N
    return d

if __name__ == '__main__':
    a = int(input("a: "), 10)
    g = int(input("g: "), 10)
    N = int(input("N: "), 10)
    print(f'{a}^{g} mod {N} = ', fast(a, g, N))
